Q1. List any five functions of the pandas library with execution.

(1) read_csv(): This function is used to read data from a CSV file and create a DataFrame.

import pandas as pd

# Read CSV file and create DataFrame
df = pd.read_csv('data.csv')

# Print the DataFrame
print(df)

(2) head(): This function is used to display the first few rows of a DataFrame.

import pandas as pd

# Create a DataFrame
data = {'Name': ['Alice', 'Bob', 'Claire'], 'Age': [25, 30, 27]}
df = pd.DataFrame(data)

# Display the first 3 rows of the DataFrame
print(df.head(3))

(3) info(): This function is used to display the information about the DataFrame, including the data types and memory usage.

import pandas as pd

# Create a DataFrame
data = {'Name': ['Alice', 'Bob', 'Claire'], 'Age': [25, 30, 27]}
df = pd.DataFrame(data)

# Display information about the DataFrame
print(df.info())

(4) describe(): This function provides statistical summary of the DataFrame, including count, mean, min, max, etc.

import pandas as pd

# Create a DataFrame
data = {'Name': ['Alice', 'Bob', 'Claire'], 'Age': [25, 30, 27]}
df = pd.DataFrame(data)

# Get the statistical summary of the DataFrame
print(df.describe())

(5) fillna(): This function is used to fill missing values in a DataFrame with a specified value or method.

import pandas as pd

# Create a DataFrame with missing values
data = {'Name': ['Alice', 'Bob', None], 'Age': [25, None, 27]}
df = pd.DataFrame(data)

# Fill missing values with 0
df_filled = df.fillna(0)

# Print the filled DataFrame
print(df_filled)

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [2]:
import pandas as pd
data = {'A':[1,2,3], 'B': [4,5,6], 'C':[7,8,9]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [13]:
def reindex_dataframe(df):
    df = df.reset_index(drop=True)
df.index = df.index.map(lambda x: x*2 + 1)
df

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [17]:
import pandas as pd
data = {'Values':[10,20,30,40,50]}
df = pd.DataFrame(data)
df

   Values
0      10
1      20
2      30
3      40
4      50

In [32]:
pd.DataFrame(data).iloc[0:3].sum()

Values    60
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [47]:
import pandas as pd
data = {'Text':['This is PWSkills', 'DS Masters Class']}
df = pd.DataFrame(data)
df

               Text
0  This is PWSkills
1  DS Masters Class

In [48]:
df['word_count'] = df['Text'].apply(lambda x: len(str(x).split()))
df

               Text  word_count
0  This is PWSkills           3
1  DS Masters Class           3

Q5. How are DataFrame.size() and DataFrame.shape() different?

(1) DataFrame.size(): This method returns the total number of elements in the DataFrame, which is equal to the number of rows multiplied by the number of columns. It provides the total count of elements, including both data values and any missing or NaN (Not a Number) values.

(2) DataFrame.shape: This attribute returns a tuple that represents the dimensions of the DataFrame. It provides the number of rows and columns in the DataFrame in the form (rows, columns).

In [49]:
import pandas as pd

# Create a sample DataFrame
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)

# Print the DataFrame size
print(df.size)

# Print the DataFrame shape
print(df.shape)

6
(3, 2)

Q6. Which function of pandas do we use to read an excel file?

To read an Excel file in pandas, the pd.read_excel() function is used. This function allows  to read the data from an Excel file and create a DataFrame in pandas.

import pandas as pd

# Read an Excel file
df = pd.read_excel('data.xlsx')

# Print the DataFrame
print(df)

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [51]:
import pandas as pd
data = {'Email': ['john.doe@example.com', 'joe.doe@example.com', 'john.cena@example.com']}
df = pd.DataFrame(data)
df

                   Email
0   john.doe@example.com
1    joe.doe@example.com
2  john.cena@example.com

In [60]:
def extract_username(email):
    return email.split('@')[0]
df['username'] = df['Email'].apply(extract_username)
df

                   Email   username
0   john.doe@example.com   john.doe
1    joe.doe@example.com    joe.doe
2  john.cena@example.com  john.cena

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [62]:
import pandas as pd
data = {'A':[3,8,6,2,9], 'B':[5,2,9,3,1], 'C': [1,7,4,5,2]}
df = pd.DataFrame(data)
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [63]:
def select_rows(df):
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_rows
selected_df = select_rows(df)
selected_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [66]:
import pandas as pd
data = {'Values':[1,2,3,4,5,6]}
df = pd.DataFrame(data)
df.describe()

         Values
count  6.000000
mean   3.500000
std    1.870829
min    1.000000
25%    2.250000
50%    3.500000
75%    4.750000
max    6.000000

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [73]:
import pandas as pd

# Sample DataFrame
data = {'Date': pd.date_range(start='2023-01-01', periods=10),
        'Sales': [10, 20, 15, 30, 25, 40, 35, 50, 45, 60]}

df = pd.DataFrame(data)

# Function to calculate moving average
def calculate_moving_average(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df

# Call the function to calculate moving average
df = calculate_moving_average(df)

# Print the DataFrame with moving average
df

        Date  Sales  MovingAverage
0 2023-01-01     10      10.000000
1 2023-01-02     20      15.000000
2 2023-01-03     15      15.000000
3 2023-01-04     30      18.750000
4 2023-01-05     25      20.000000
5 2023-01-06     40      23.333333
6 2023-01-07     35      25.000000
7 2023-01-08     50      30.714286
8 2023-01-09     45      34.285714
9 2023-01-10     60      40.714286

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
    Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:
    Date     Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [100]:
import pandas as pd
data = {'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']}
df = pd.DataFrame(data)
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [103]:
def create_weekday_column(df):
    df['Weekday'] = pd.to_datetime(df['Date']).dt.day_name()
    return df
df = create_weekday_column(df)
df

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [2]:
import pandas as pd
data = {'Date': ['2023-01-01', '2023-01-15', '2023-01-31', '2023-02-10']}
df = pd.DataFrame(data)


def select_rows_between_dates(df, start_date, end_date):
    df['Date'] = pd.to_datetime(df['Date'])  # Convert 'Date' column to datetime if it's not already
    selected_rows = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]
    return selected_rows


selected_rows = select_rows_between_dates(df, '2023-01-01', '2023-01-31')

selected_rows

        Date
0 2023-01-01
1 2023-01-15
2 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

The first and foremost necessary library that needs to be imported to use the basic functions of pandas is the pandas library itself. The pandas library provides the primary data structures and functions for data manipulation and analysis.

The pandas library can be imported by the following statement:
import pandas as pd